; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v8 ?v12)
             (pred_7 ?v10 ?v1)
             (pred_2 ?v8 ?v1)
             (pred_6 ?v4 ?v8 )
	     (pred_3 ?v8)
             (pred_4 ?v5)
             (pred_9 ?v10)
             (pred_8 ?v1)
             (pred_10 ?v8)
             (pred_5 ?v10)
             (pred_11 ?v8)
             (pred_12 ))



(:action op_3
:parameters (?v7 ?v11 ?v2 ?v9)
:precondition (and (pred_4 ?v7) (pred_4 ?v11) (pred_9 ?v2) (pred_8 ?v9)
          (pred_1 ?v7 ?v11) (pred_7 ?v2 ?v9)
                   (pred_2 ?v11 ?v9) (pred_3 ?v7) 
                   (pred_10 ?v11) (pred_5 ?v2))
:effect (and  (pred_11 ?v11) (not (pred_10 ?v11))))


(:action op_5
:parameters (?v7 ?v6)
:precondition (and (pred_4 ?v7) (pred_4 ?v6)
               (pred_3 ?v7) (pred_1 ?v7 ?v6) (pred_11 ?v6))
:effect (and (pred_3 ?v6) (not (pred_3 ?v7))))

(:action op_4
:parameters (?v7 ?v2)
:precondition (and (pred_4 ?v7) (pred_9 ?v2) 
                  (pred_3 ?v7) (pred_6 ?v2 ?v7) (pred_12 ))
:effect (and (pred_5 ?v2)
   (not (pred_6 ?v2 ?v7)) (not (pred_12 ))))


(:action op_2
:parameters (?v7 ?v13 ?v3)
:precondition (and (pred_4 ?v7) (pred_9 ?v13) (pred_9 ?v3)
                  (pred_3 ?v7) (pred_5 ?v3) (pred_6 ?v13 ?v7))
:effect (and (pred_5 ?v13) (pred_6 ?v3 ?v7)
        (not (pred_5 ?v3)) (not (pred_6 ?v13 ?v7))))

(:action op_1
:parameters (?v7 ?v2)
:precondition (and (pred_4 ?v7) (pred_9 ?v2) 
                  (pred_3 ?v7) (pred_5 ?v2))
:effect (and (pred_12 ) (pred_6 ?v2 ?v7) (not (pred_5 ?v2)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_13 obj_08 obj_03 obj_02 obj_07 obj_04 obj_09 obj_01 obj_06
    obj_05 obj_11
    obj_10 obj_12
    )

    (:init
       (pred_12)

       (pred_4 obj_13)
       (pred_4 obj_08)
       (pred_4 obj_03)
       (pred_4 obj_02)
       (pred_4 obj_07)
       (pred_4 obj_04)
       (pred_4 obj_09)
       (pred_4 obj_01)
       (pred_4 obj_06)
       (pred_8 obj_05)
       (pred_8 obj_11)
       (pred_9 obj_10)
       (pred_9 obj_12)

       (pred_1 obj_13 obj_02)
       (pred_1 obj_13 obj_08)
       (pred_1 obj_08 obj_07)
       (pred_1 obj_08 obj_03)
       (pred_1 obj_08 obj_13)
       (pred_1 obj_03 obj_04)
       (pred_1 obj_03 obj_08)
       (pred_1 obj_02 obj_09)
       (pred_1 obj_02 obj_07)
       (pred_1 obj_02 obj_13)
       (pred_1 obj_07 obj_01)
       (pred_1 obj_07 obj_04)
       (pred_1 obj_07 obj_08)
       (pred_1 obj_07 obj_02)
       (pred_1 obj_04 obj_06)
       (pred_1 obj_04 obj_03)
       (pred_1 obj_04 obj_07)
       (pred_1 obj_09 obj_01)
       (pred_1 obj_09 obj_02)
       (pred_1 obj_01 obj_06)
       (pred_1 obj_01 obj_07)
       (pred_1 obj_01 obj_09)
       (pred_1 obj_06 obj_04)
       (pred_1 obj_06 obj_01)
       (pred_10 obj_03)
       (pred_10 obj_06)
       (pred_2  obj_03 obj_05)
       (pred_2  obj_06 obj_11)
       (pred_11 obj_13)
       (pred_11 obj_08)
       (pred_11 obj_02)
       (pred_11 obj_07)
       (pred_11 obj_04)
       (pred_11 obj_09)
       (pred_11 obj_01)

       (pred_7  obj_10 obj_05)
       (pred_7  obj_12 obj_11)
       (pred_6 obj_10 obj_02)
       (pred_6 obj_12 obj_13)
       (pred_3 obj_07)
    )

    (:goal (and
       (pred_6 obj_12 obj_06)
    ))
(:constraints
  (always (not (pred_3 obj_08)))
)
)

; plan
1. (op_5 obj_07 obj_02)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_02)
   goals met: 0 of 1
2. (op_5 obj_02 obj_13)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_13)
   goals met: 0 of 1
3. (op_4 obj_13 obj_12)
   deleted: (pred_6 obj_12 obj_13) (pred_12)
   added: (pred_5 obj_12)
   goals met: 0 of 1
4. (op_5 obj_13 obj_02)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_02)
   goals met: 0 of 1
5. (op_5 obj_02 obj_07)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_07)
   goals met: 0 of 1
6. (op_5 obj_07 obj_04)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_04)
   goals met: 0 of 1
7. (op_3 obj_04 obj_06 obj_12 obj_11)
   deleted: (pred_10 obj_06)
   added: (pred_11 obj_06)
   goals met: 0 of 1
8. (op_5 obj_04 obj_06)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_06)
   goals met: 0 of 1
9. (op_1 obj_06 obj_12)
   deleted: (pred_5 obj_12)
   added: (pred_12) (pred_6 obj_12 obj_06)
   goals met: 1 of 1
